{
  "add_blank": true,
  "added_tokens_decoder": {
    "0": {
      "content": "k",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "38": {
      "content": "<unk>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    }
  },
  "clean_up_tokenization_spaces": true,
  "is_uroman": false,
  "language": "eng",
  "model_max_length": 4096,
  "normalize": true,
  "pad_token": "k",
  "phonemize": false,
  "tokenizer_class": "VitsTokenizer",
  "unk_token": "<unk>"
}
